import { Injectable } from '@angular/core';
import { FirstArticle } from 'src/models/firstPage.module';
import { SecondArticle } from 'src/models/secondPage.module';

@Injectable({
  providedIn: 'root'
})
export class ArticlesService {
  articlesFirstPage: Array<FirstArticle> =
  [
    {id: 0, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/1101236/054b336d667939c3078f8b428b431a27/960x540', header: '«Назад в будущее» — 35 лет: Почему продолжение трилогии Земекиса невозможно', description: 'Первая часть будущей трилогии о приключениях Марти Макфлая символично вышла после 1984 года, во время новых надежд. Экономический кризис семидесятых закончился, новый президент США Рейган уверенно ведет страну к процветанию, хотя его консервативная политика нравится не всем. Зато на глазах у молодого поколения начинает осуществляться фантастическое будущее.'},
    {id: 1, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/2423210/6538c35313c266a4fc7cf391c1af2b8f/960x540', header: '«Шестое чувство»: Как хоррор стал утешением', description: 'Воспоминания актеров о работе над «Шестым чувством» полны историй преодоления. В своем стремлении снять наконец фильм по-своему Шьямалан не щадил никого.'},
    {id: 2, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/1539913/e6dd24cbe07ab6ecd0d31dedd58b870f/960x540', header: '«Побег из Шоушенка»: Самый лучший фильм', description: 'Cама история, рассказанная в «Побеге», довольно незамысловата. Все начинается в 1948 году с суда над банкиром Энди Дюфрейном, которого играет Тим Роббинс. Мы заведомо знаем, что он не убивал свою жену с любовником, а суд заведомо не может ему поверить.'},
  ];

  articlesSecondPage: Array<SecondArticle> =
  [
    {id: 3, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/1101693/8d608e0c612a613719e829511562fd43/960', header: 'Новая серия «Мандалорца»: Что это было? Боба Фетт правда вернулся?', description: 'Мандалорец Дин Джарин (с голосом Педро Паскаля) путешествует по далекой-далекой галактике в поисках других мандалорцев. С их помощью он надеется найти сородичей Малыша и передать его им. Так он попадает в ловушку...'},
    {id: 4, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/1642096/dd5f81fd384ddf8976eb044f7da4379e/960x540', header: 'От Queen до уличного рэпа: Фильмы, которые должен посмотреть каждый музыкант', description: 'Успех вышедшего в 2018 году байопика рок-группы Queen и ее фронтмена Фредди Меркьюри оказался настолько мощным, что поднял продажи пластинок коллектива во всем мире, в том числе и в США, где британская группа была менее популярна, чем на родине.'},
    {id: 5, imgSrc: 'https://avatars.mds.yandex.net/get-kinopoisk-post-img/1101693/5bc44bf4cea74db3a7366790f7db86e5/960x540', header: 'Как устроено время в фильмах Кристофера Нолана', description: 'В фильме «Довод» был эпизод, в котором герой Джона Дэвида Вашингтона испытывает новое оружие. Он стреляет из пистолета, но на самом деле как будто ловит пулю. Ему говорят, что это называется инверсией. Но первым фильмом Нолана, в котором использовалось обратное течение времени, был «Помни».'},
  ];

  constructor() { }
  getArt(id: number)
  {
    return this.articlesFirstPage.find((el) => el.id === id);
  }

  getFirst()
  {
    return this.articlesFirstPage;
  }
}
